---
kind: property
id: P:Autodesk.Revit.DB.DimensionType.AlternateUnitsPrefix
source: html/c2e2e6e4-4042-ca9d-e537-8d7430e621c9.htm
---
# Autodesk.Revit.DB.DimensionType.AlternateUnitsPrefix Property

The prefix text for the alternate units value.

## Syntax (C#)
```csharp
public string AlternateUnitsPrefix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null